package com.example.myrustore.data.local

import com.example.myrustore.R
import com.example.myrustore.data.model.AgeRating
import com.example.myrustore.data.model.AppItem
import com.example.myrustore.data.model.Category

object LocalDataSource {
    val apps = listOf(
        // Финансы — Альфа-Банк
        AppItem(
            id = "alfa",
            iconUrl = "",
            iconRes = R.drawable.ic_alfa,
            name = "Альфа-Банк",
            shortDescription = "Лучший мобильный банк по версии Markswebb",
            longDescription = """
                Лучший мобильный банк пять лет подряд по версии Markswebb.

                Мобильное приложение Альфа-Банка — это безопасный доступ к вашим счетам и банковским картам. В любой момент вы можете сделать быстрый перевод близкому человеку, проверить, сколько денег осталось, оформить кредит онлайн или пополнить счёт мобильного.

                Платить онлайн — легко и приятно. Реквизиты карт всегда доступны в приложении, и нет комиссии за оплату коммунальных платежей, телефона и других услуг. А переводить — выгодно: до 100 000 ₽ в месяц бесплатно по номеру телефона в любые банки.

                🛡 Ваши деньги под защитой.
                В приложение можно войти по пин-коду, с помощью распознавания лица или отпечатка пальца — выбирайте любой удобный способ защиты для вас.
            """.trimIndent(),
            developer = "Альфа-Банк",
            category = Category.Финансы,
            age = AgeRating.R0,
            screenshots = emptyList()
        ),

        // Транспорт — Яндекс Go
        AppItem(
            id = "yandex_go",
            iconUrl = "",
            iconRes = R.drawable.ic_yandex_go,
            name = "Яндекс Go",
            shortDescription = "Такси, самокаты, доставка и еда",
            longDescription = """
                Яндекс Go — такси, доставка посылок, самокаты и еда из ресторанов.

                • ТАКСИ
                Выбирайте и сравнивайте тарифы.
                «Эконом» — такси на каждый день.
                «Комфорт» и «Комфорт+» — чтобы расслабиться в просторном салоне.
                «Минивэн» — для большой компании, перевозки лыж, велосипеда или поездок в аэропорт.
                «Вместе» — поездки с попутчиком и скидкой.
                «Межгород» — для удобных поездок между городами.
            """.trimIndent(),
            developer = "Яндекс",
            category = Category.Транспорт,
            age = AgeRating.R0,
            screenshots = emptyList()
        ),

        // Государственные — Дневник МЭШ
        AppItem(
            id = "mesh",
            iconUrl = "",
            iconRes = R.drawable.ic_mash,
            name = "Дневник МЭШ",
            shortDescription = "Официальное приложение московских школ",
            longDescription = """
                Дневник МЭШ — официальное мобильное приложение для московских школьников и их родителей.
                С помощью приложения вы получите доступ к цифровым образовательным сервисам
                Московской Электронной Школы.
            """.trimIndent(),
            developer = "Департамент образования Москвы",
            category = Category.Государственные,
            age = AgeRating.R0,
            screenshots = emptyList()
        ),

        // Государственные — Госуслуги
        AppItem(
            id = "gosuslugi",
            iconUrl = "",
            iconRes = R.drawable.ic_gos,
            name = "Госуслуги",
            shortDescription = "Ваш помощник для взаимодействия с государством",
            longDescription = """
                Приложение «Госуслуги» — ваш помощник для взаимодействия с ведомствами и государством.

                В приложении можно оплачивать штрафы и госпошлины, подавать заявления в ведомства,
                хранить личные документы и предъявлять их в бытовых ситуациях,
                сканировать товары, управлять согласиями на использование личных и биометрических данных и многое другое.
            """.trimIndent(),
            developer = "Минцифры России",
            category = Category.Государственные,
            age = AgeRating.R0,
            screenshots = emptyList()
        ),

        // Инструменты — Почта Mail
        AppItem(
            id = "mail_ru",
            iconUrl = "",
            iconRes = R.drawable.ic_mail,
            name = "Почта Mail",
            shortDescription = "Быстрый и удобный почтовый клиент",
            longDescription = """
                Почта Mail — ваш быстрый и удобный почтовый клиент.

                Добавьте все свои аккаунты и читайте электронную почту с ящиков на Mail, Яндекс,
                Microsoft Outlook, Gmail, Rambler, Yahoo и других сервисов.
                Отправляйте письма, записывайте дела в календарь, загружайте фото и документы в Облако Mail.
                Звонки, новости и погода — всё в одном приложении!
            """.trimIndent(),
            developer = "VK",
            category = Category.Инструменты,
            age = AgeRating.R0,
            screenshots = emptyList()
        ),

        // Игры — Minecraft
        AppItem(
            id = "minecraft",
            iconUrl = "",
            iconRes = R.drawable.ic_minecraft,
            name = "Minecraft",
            shortDescription = "Строй, исследуй, выживай",
            longDescription = """
                СОЗДАВАЙТЕ
                Дайте волю фантазии и стройте всё, что хотите, в своём бесконечном уникальном мире.

                ИССЛЕДУЙТЕ
                Изучайте биомы, ресурсы и мобов. Путешествуйте по миру, полному неожиданностей.

                ВЫЖИВАЙТЕ
                Вас ждут приключения, схватки с врагами и путешествия по потрясающим местам и измерениям.
            """.trimIndent(),
            developer = "Mojang",
            category = Category.Игры,
            age = AgeRating.R6,
            screenshots = emptyList()
        ),
    )

    fun appById(id: String) = apps.first { it.id == id }
}
